blog/26.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 3.3.2 Representing Queues
#+subtitle: 2024-03-03 Sun
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)

* 3.3.2 Representing Queues

A queue is defined in terms of its interface:

- a constructor: ~(make-queue)~;
- two selectors:
  - ~(empty-queue? <QUEUE>)~
  - ~(front-queue <QUEUE>)~
- two mutators:
  - ~(insert-queue! <QUEUE> <ITEM>)~
  - ~(delete-queue! <QUEUE>)~.

We could represent a queue as an ordinary list. However, if we did so,
then inserting an element at the end of it would require traversing
the whole list, thereby requiring O(n) steps. Authors present the
implementation of a queue with allows to insert an item in O(1). This
is possible by representing the queue as an ordinary list while also
retaining a pointer to the end of it.

#+begin_src
  *Figure 3.19:* Implementation of a queue as a list with front and
     rear pointers.

                 +---+---+
            q -->| * | *-+-------------------+
                 +-|-+---+                   |
                   |                         |
                   | front-ptr               | rear-ptr
                   V                         V
               +---+---+    +---+---+    +---+---+
               | * | *-+--->| * | *-+--->| * | / |
               +-|-+---+    +-|-+---+    +-|-+---+
                 V            V            V
               +---+        +---+        +---+
               | a |        | b |        | c |
               +---+        +---+        +---+

[Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007)]
#+end_src

Here is the code:

#+begin_src scheme
  (define (front-ptr queue) (car queue))

  (define (rear-ptr queue) (cdr queue))

  (define (set-front-ptr! queue item) (set-car! queue item))

  (define (set-rear-ptr! queue item) (set-cdr! queue item))

  (define (empty-queue? queue) (null? (front-ptr queue)))

  (define (make-queue) (cons '() '()))

  (define (front-queue queue)
    (if (empty-queue? queue)
        (error "FRONT called with an empty queue" queue)
        (car (front-ptr queue))))

  (define (insert-queue! queue item)
    (let ((new-pair (cons item '())))
      (cond ((empty-queue? queue)
             (set-front-ptr! queue new-pair)
             (set-rear-ptr! queue new-pair)
             queue)
            (else
             (set-cdr! (rear-ptr queue) new-pair)
             (set-rear-ptr! queue new-pair)
             queue))))

  (define (delete-queue! queue)
    (cond ((empty-queue? queue)
           (error "DELETE! called with an empty queue" queue))
          (else
           (set-front-ptr! queue (cdr (front-ptr queue)))
           queue)))
#+end_src
** Exercise 3.21
*Exercise*:

#+begin_quote
Ben Bitdiddle decides to test the queue implementation described
above.  He types in the procedures to the Lisp interpreter and
proceeds to try them out:

#+begin_src scheme
(define q1 (make-queue))

(insert-queue! q1 'a)
((a) a)

(insert-queue! q1 'b)
((a b) b)

(delete-queue! q1)
((b) b)

(delete-queue! q1)
(() b)
#+end_src

"It's all wrong!" he complains.  "The interpreter's response shows
that the last item is inserted into the queue twice.  And when I
delete both items, the second ~b~ is still there, so the queue isn't
empty, even though it's supposed to be."  Eva Lu Ator suggests that
Ben has misunderstood what is happening.  "It's not that the items are
going into the queue twice," she explains.  "It's just that the
standard Lisp printer doesn't know how to make sense of the queue
representation.  If you want to see the queue printed correctly,
you'll have to define your own print procedure for queues." Explain
what Eva Lu is talking about.  In particular, show why Ben's examples
produce the printed results that they do.  Define a procedure
~print-queue~ that takes a queue as input and prints the sequence of
items in the queue.
#+end_quote

*Answer*:

The interpreter is printing the structures /qua/ lists, not /qua/
queues. Such lists represent queues only because we have established a
convention according to which a queue is represented by a pair whose
~car~ points to a simple list of elements and whose ~cdr~ points to
the last element of the same list the ~car~ points to. The interpreter
just prints that pair as if it was a normal pair.

The following creates a list whose ~car~ is a list which contains ~'a~
only and whose ~cdr~ is that list too.

#+begin_src scheme
(define q1 (make-queue))
(insert-queue! q1 'a)
#+end_src

So ~((a) a)~ is exactly what we would expect the interpreter to
print. /Mutatis mutandis/ for structures created by ~(insert-queue! q1
'b)~, ~(delete-queue! q1)~, and ~(delete-queue! q1)~.

To print the queue we can simply print the ``ordinary list'' the front
pointer is pointing at:

#+begin_src scheme
  (define (print-queue queue)
    (display (front-ptr queue)))
#+end_src

