blog/26.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-03 Sun 11:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 3.3.2 Representing Queues</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 3.3.2 Representing Queues
<br />
<span class="subtitle">2024-03-03 Sun</span>
</h1>

<div id="outline-container-org041d60f" class="outline-2">
<h2 id="org041d60f">3.3.2 Representing Queues</h2>
<div class="outline-text-2" id="text-org041d60f">
<p>
A queue is defined in terms of a its interface:
</p>

<ul class="org-ul">
<li>a constructor: <code>(make-queue)</code>;</li>
<li>two selectors:
<ul class="org-ul">
<li><code>(empty-queue? &lt;QUEUE&gt;)</code></li>
<li><code>(front-queue &lt;QUEUE&gt;)</code></li>
</ul></li>
<li>two mutators:
<ul class="org-ul">
<li><code>(insert-queue! &lt;QUEUE&gt; &lt;ITEM&gt;)</code></li>
<li><code>(delete-queue! &lt;QUEUE&gt;)</code>.</li>
</ul></li>
</ul>

<p>
We could represent a queue as an ordinary list. However, if we did so,
then inserting an element at the end of it would require traversing
the whole list, thereby requiring O(n) steps. Authors present the
implementation of a queue with allows to insert an item in O(1). This
is possible by representing the queue as an ordinary list while also
retaining a pointer to the end of it.
</p>

<pre class="example">
  *Figure 3.19:* Implementation of a queue as a list with front and
     rear pointers.

                 +---+---+
            q --&gt;| * | *-+-------------------+
                 +-|-+---+                   |
                   |                         |
                   | front-ptr               | rear-ptr
                   V                         V
               +---+---+    +---+---+    +---+---+
               | * | *-+---&gt;| * | *-+---&gt;| * | / |
               +-|-+---+    +-|-+---+    +-|-+---+
                 V            V            V
               +---+        +---+        +---+
               | a |        | b |        | c |
               +---+        +---+        +---+

[Figure from SICP Unofficial Texinfo Format version 2.neilvandyke4 (January 10, 2007)]
</pre>

<p>
Here is the code:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">front-ptr</span> queue) (car queue))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rear-ptr</span> queue) (cdr queue))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-front-ptr!</span> queue item) (set-car! queue item))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-rear-ptr!</span> queue item) (set-cdr! queue item))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">empty-queue?</span> queue) (null? (front-ptr queue)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-queue</span>) (cons '() '()))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">front-queue</span> queue)
  (<span style="color: #531ab6;">if</span> (empty-queue? queue)
      (error <span style="color: #3548cf;">"FRONT called with an empty queue"</span> queue)
      (car (front-ptr queue))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">insert-queue!</span> queue item)
  (<span style="color: #531ab6;">let</span> ((new-pair (cons item '())))
    (<span style="color: #531ab6;">cond</span> ((empty-queue? queue)
           (set-front-ptr! queue new-pair)
           (set-rear-ptr! queue new-pair)
           queue)
          (<span style="color: #531ab6;">else</span>
           (set-cdr! (rear-ptr queue) new-pair)
           (set-rear-ptr! queue new-pair)
           queue))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">delete-queue!</span> queue)
  (<span style="color: #531ab6;">cond</span> ((empty-queue? queue)
         (error <span style="color: #3548cf;">"DELETE! called with an empty queue"</span> queue))
        (<span style="color: #531ab6;">else</span>
         (set-front-ptr! queue (cdr (front-ptr queue)))
         queue)))
</pre>
</div>
</div>
<div id="outline-container-org4e9a510" class="outline-3">
<h3 id="org4e9a510">Exercise 3.21</h3>
<div class="outline-text-3" id="text-org4e9a510">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Ben Bitdiddle decides to test the queue implementation described
above.  He types in the procedures to the Lisp interpreter and
proceeds to try them out:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">q1</span> (make-queue))

(insert-queue! q1 'a)
((a) a)

(insert-queue! q1 'b)
((a b) b)

(delete-queue! q1)
((b) b)

(delete-queue! q1)
(() b)
</pre>
</div>

<p>
"It's all wrong!" he complains.  "The interpreter's response shows
that the last item is inserted into the queue twice.  And when I
delete both items, the second <code>b</code> is still there, so the queue isn't
empty, even though it's supposed to be."  Eva Lu Ator suggests that
Ben has misunderstood what is happening.  "It's not that the items are
going into the queue twice," she explains.  "It's just that the
standard Lisp printer doesn't know how to make sense of the queue
representation.  If you want to see the queue printed correctly,
you'll have to define your own print procedure for queues." Explain
what Eva Lu is talking about.  In particular, show why Ben's examples
produce the printed results that they do.  Define a procedure
<code>print-queue</code> that takes a queue as input and prints the sequence of
items in the queue.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
The interpreter is printing the structures <i>qua</i> lists, not <i>qua</i>
queues. Such lists represent queues only because we have established a
convention according to which a queue is represented by a pair whose
<code>car</code> points to a simple list of elements and whose <code>cdr</code> points to
the last element of the same list the <code>car</code> points to. The interpreter
just prints that pair as if it was a normal pair.
</p>

<p>
The following creates a list whose <code>car</code> is a list which contains <code>'a</code>
only and whose <code>cdr</code> is that list too.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">q1</span> (make-queue))
(insert-queue! q1 'a)
</pre>
</div>

<p>
So <code>((a) a)</code> is exactly what we would expect the interpreter to
print. <i>Mutatis mutandis</i> for structures created by <code>(insert-queue! q1
'b)</code>, <code>(delete-queue! q1)</code>, and <code>(delete-queue! q1)</code>.
</p>

<p>
To print the queue we can simply print the ``ordinary list'' the front
pointer is pointing at:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">print-queue</span> queue)
  (display (front-ptr queue)))
</pre>
</div>
</div>
</div>
