blog/26.html

<div id="outline-container-orgd75812d" class="outline-3">
<h3 id="orgd75812d">Exercise 3.22</h3>
<div class="outline-text-3" id="text-orgd75812d">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Instead of representing a queue as a pair of pointers, we can build a
queue as a procedure with local state.  The local state will consist
of pointers to the beginning and the end of an ordinary list.  Thus,
the `make-queue' procedure will have the form
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-queue</span>)
  (<span style="color: #531ab6;">let</span> ((front-ptr ... )
        (rear-ptr ... ))
    &lt;DEFINITIONS OF INTERNAL PROCEDURES&gt;
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> m) ...)
    dispatch))
</pre>
</div>

<p>
Complete the definition of <code>make-queue</code> and provide implementations of
the queue operations using this representation.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-queue</span>)
  (<span style="color: #531ab6;">let</span> ((front-ptr nil)
        (rear-ptr nil))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> m)
      (<span style="color: #531ab6;">cond</span> ((eq? m 'empty-queue?) (null? front-ptr))
            ((eq? m 'front-queue)
             (<span style="color: #531ab6;">cond</span> ((null? front-ptr)
                    (error <span style="color: #3548cf;">"FRONT called with an empty queue"</span>))
                   (<span style="color: #531ab6;">else</span> (car front-ptr))))
            ((eq? m 'insert-queue) (<span style="color: #531ab6;">lambda</span> (item)
                                     (<span style="color: #531ab6;">let</span> ((new-pair (cons item '())))
                                       (<span style="color: #531ab6;">cond</span> ((null? front-ptr)
                                              (set! front-ptr new-pair)
                                              (set! rear-ptr new-pair)
                                              front-ptr)
                                             (<span style="color: #531ab6;">else</span>
                                              (set-cdr! rear-ptr new-pair)
                                              (set! rear-ptr new-pair)
                                              front-ptr)))))
            ((eq? m 'delete-queue)
             (<span style="color: #531ab6;">cond</span> ((null? front-ptr)
                    (error <span style="color: #3548cf;">"DELETE! called with an empty queue"</span>))
                   (<span style="color: #531ab6;">else</span>
                    (set! front-ptr (cdr front-ptr))
                    front-ptr)))
            (<span style="color: #531ab6;">else</span> (error <span style="color: #3548cf;">"unknown request sorry (at least for now)"</span>))))
    dispatch))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">queue</span> (make-queue))
(queue 'empty-queue?) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; #t</span>
((queue 'insert-queue) 'hello) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (hello)</span>
(queue 'empty-queue?) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; #f</span>
(queue 'front-queue) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; hello</span>
((queue 'insert-queue) 'world) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (hello world)</span>
(queue 'empty-queue?) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; #f</span>
(queue 'front-queue) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; hello</span>
(queue 'delete-queue) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (world)</span>
(queue 'front-queue) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; world</span>
(queue 'delete-queue) <span style="color: #595959;">;; </span><span style="color: #595959;">()</span>
(queue 'empty-queue?) <span style="color: #595959;">;; </span><span style="color: #595959;">#t</span>
</pre>
</div>

<p>
In Emacs-lisp:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #595959;">;; </span><span style="color: #595959;">-*- lexical-binding: t -*-</span>

(<span style="color: #531ab6;">defun</span> <span style="color: #721045;">make-queue</span> ()
  (<span style="color: #531ab6;">let</span> ((front-ptr nil)
        (rear-ptr nil))
    (<span style="color: #531ab6;">lambda</span> (m)
      (<span style="color: #531ab6;">cond</span> ((eq m 'empty-queue) (null front-ptr))
            ((eq m 'front-queue)
             (<span style="color: #531ab6;">cond</span> ((null front-ptr)
                    (<span style="color: #884900;">error</span> <span style="color: #3548cf;">"FRONT called with an empty queue"</span>))
                   (t (car front-ptr))))
            ((eq m 'insert-queue) (<span style="color: #531ab6;">lambda</span> (item)
                                    (<span style="color: #531ab6;">let</span> ((new-pair (cons item '())))
                                      (<span style="color: #531ab6;">cond</span> ((null front-ptr)
                                             (<span style="color: #531ab6;">setq</span> front-ptr new-pair)
                                             (<span style="color: #531ab6;">setq</span> rear-ptr new-pair)
                                             front-ptr)
                                            (t
                                             (setcdr rear-ptr new-pair)
                                             (<span style="color: #531ab6;">setq</span> rear-ptr new-pair)
                                             front-ptr)))))
            ((eq m 'delete-queue)
             (<span style="color: #531ab6;">cond</span> ((null front-ptr)
                    (<span style="color: #884900;">error</span> <span style="color: #3548cf;">"DELETE! called with an empty queue"</span>))
                   (t
                    (<span style="color: #531ab6;">setq</span> front-ptr (cdr front-ptr))
                    front-ptr)))
            (t (<span style="color: #884900;">error</span> <span style="color: #3548cf;">"unknown request sorry (at least for now)"</span>))))))

(<span style="color: #531ab6;">let</span> ((queue (make-queue)))
  (message <span style="color: #3548cf;">"Queue initially empty: %s"</span> (funcall queue 'empty-queue)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; t</span>

  (funcall (funcall queue 'insert-queue) 'hello) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (hello)</span>

  (message <span style="color: #3548cf;">"Queue empty after insertion: %s"</span> (funcall queue 'empty-queue)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; nil</span>

  (message <span style="color: #3548cf;">"Front of queue: %s"</span> (funcall queue 'front-queue)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; hello</span>

  (funcall (funcall queue 'insert-queue) 'world) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (hello world)</span>

  (funcall queue 'delete-queue) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (world)</span>

  (message <span style="color: #3548cf;">"Front of queue after deletion: %s"</span> (funcall queue 'front-queue)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; world</span>

  (funcall queue 'delete-queue) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; nil</span>

  (message <span style="color: #3548cf;">"Queue empty after all deletions: %s"</span> (funcall queue 'empty-queue)) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; t</span>
  )
</pre>
</div>
</div>
</div>
