blog/26.html

<div id="outline-container-orgbd47f95" class="outline-3">
<h3 id="orgbd47f95">Exercise 3.23</h3>
<div class="outline-text-3" id="text-orgbd47f95">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
A "deque" ("double-ended queue") is a sequence in which items can be
inserted and deleted at either the front or the rear.  Operations on
deques are the constructor <code>make-deque</code>, the predicate <code>empty-deque?</code>,
selectors <code>front-deque</code> and <code>rear-deque</code>, and mutators
<code>front-insert-deque!</code>, <code>rear-insert-deque!</code>, <code>front-delete-deque!</code>,
and <code>rear-delete-deque!</code>.  Show how to represent deques using pairs,
and give implementations of the operations.(2) All operations should
be accomplished in [theta](1) steps.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
Here is what the structure of my deque's implementation looks like:
</p>
<pre class="example">
         +---+---+
deque --&gt;| * | *-+---------------------------+
         +-|-+---+                           |
           |                                 |
           | front-ptr                       | rear-ptr
           V                                 V
       +---+---+        +---+---+        +---+---+
       | * | *-+-------&gt;| * | *-+-------&gt;| * | / |
       +-|-+---+        +-|-+---+        +-|-+---+
         |   ^______      |   ^______      |
         V          \     V          \     V
       +---+---+     \  +---+---+     \  +---+---+
       | \ | * +      \-|-* | * |      \-|-* | * |
       +---+-|-+        +---+-|-+        +---+-|-+
             V                V                V
            'a               'b               'c
</pre>

<p>
Basically, instead of having a head-and-tail pointer for a list of
values, like in the queue's case, we have a head-and-tail pointer for
a list of pairs, each of which holds (in the <code>car</code>) a pointer to the
previous pair and (in the <code>cdr</code>) a value. This is one way in which we
can use pairs to build a so-called doubly-linked lists.
</p>

<p>
Here is the scheme:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-deque</span>)
  (<span style="color: #531ab6;">let</span> ((front-ptr nil)
        (rear-ptr nil))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">dispatch</span> m)
      (<span style="color: #531ab6;">cond</span> ((eq? m 'empty-deque?) (null? front-ptr))
            ((eq? m 'front-deque)
             (<span style="color: #531ab6;">cond</span> ((null? front-ptr)
                    (error <span style="color: #3548cf;">"FRONT called with an empty deque"</span>))
                   (<span style="color: #531ab6;">else</span> (cdar front-ptr))))
            ((eq? m 'rear-deque)
             (<span style="color: #531ab6;">cond</span> ((null? rear-ptr)
                    (error <span style="color: #3548cf;">"REAR called with an empty deque"</span>))
                   (<span style="color: #531ab6;">else</span> (cdar rear-ptr))))
            ((eq? m 'front-insert-deque!) (<span style="color: #531ab6;">lambda</span> (item)
                                            (<span style="color: #531ab6;">let</span> ((prev-and-value-pair (cons nil item)))
                                              (<span style="color: #531ab6;">let</span> ((new-pair (cons prev-and-value-pair front-ptr)))
                                                (<span style="color: #531ab6;">cond</span> ((null? front-ptr)
                                                       (set! front-ptr new-pair)
                                                       (set! rear-ptr new-pair))
                                                      (<span style="color: #531ab6;">else</span>
                                                       (set-car! (car front-ptr) new-pair)
                                                       (set! front-ptr new-pair)))))))
            ((eq? m 'rear-insert-deque!) (<span style="color: #531ab6;">lambda</span> (item)
                                           (<span style="color: #531ab6;">let</span> ((prev-and-value-pair (cons rear-ptr item)))
                                             (<span style="color: #531ab6;">let</span> ((new-pair (cons prev-and-value-pair nil)))
                                               (<span style="color: #531ab6;">cond</span> ((null? rear-ptr)
                                                      (set! front-ptr new-pair)
                                                      (set! rear-ptr new-pair))
                                                     (<span style="color: #531ab6;">else</span>
                                                      (set-cdr! rear-ptr new-pair)
                                                      (set! rear-ptr new-pair)))))))
            ((eq? m 'front-delete-deque!)
             (<span style="color: #531ab6;">cond</span> ((null? front-ptr)
                    (error <span style="color: #3548cf;">"DELETE! called with an empty deque"</span>))
                   ((eq? front-ptr rear-ptr) <span style="color: #595959;">;; </span><span style="color: #595959;">if so there is only one el</span>
                    (set! front-ptr nil)
                    (set! rear-ptr nil)
                    front-ptr)
                   (<span style="color: #531ab6;">else</span>
                    (set! front-ptr (cdr front-ptr))
                    (<span style="color: #531ab6;">and</span> front-ptr
                         (cdar front-ptr)))))
            ((eq? m 'rear-delete-deque!)
             (<span style="color: #531ab6;">cond</span> ((null? rear-ptr)
                    (error <span style="color: #3548cf;">"DELETE! called with an empty deque"</span>))
                   ((eq? front-ptr rear-ptr)  <span style="color: #595959;">;; </span><span style="color: #595959;">if so there is only one el</span>
                    (set! front-ptr nil)
                    (set! rear-ptr nil)
                    rear-ptr)
                   (<span style="color: #531ab6;">else</span>
                    (set! rear-ptr (caar rear-ptr))
                    (<span style="color: #531ab6;">and</span> rear-ptr (cdar rear-ptr)))))))
    dispatch))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">my-deque</span> (make-deque))

((my-deque 'front-insert-deque!) 'hello)

(my-deque 'front-deque) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; hello</span>
(my-deque 'rear-deque) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; hello</span>

((my-deque 'rear-insert-deque!) 'world)

(my-deque 'front-deque) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; hello</span>
(my-deque 'rear-deque) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; world</span>

(my-deque 'front-delete-deque!) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; world</span>

(my-deque 'front-deque) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; world</span>
(my-deque 'rear-deque) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; world</span>

(my-deque 'rear-delete-deque!) <span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; ()</span>

(my-deque 'front-deque) <span style="color: #595959;">;; </span><span style="color: #595959;">error: FRONT called with an empty deque</span>
</pre>
</div>

<div style="text-align: center;">
<a href="./posts.html">←</a>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span></p>
</div>
</body>
</html>
